using System;
using System.Collections.Generic;
using System.Text;

namespace UniSchedule.Helpers
{
    class Disciplines
    { 
        public Dictionary<string,string> DisciplineNames { get; set; }

        public Disciplines()
        {
            DisciplineNames = new Dictionary<string, string>();
            DisciplineNames.Add("Базоваматематиказаинженери", "Базова математика за инженери");
            DisciplineNames.Add("Софтуернитехнологии", "Софтуерни технологии");
            DisciplineNames.Add("Основинакомпютърнитесистеми", "Основи на компютърните системи");
            DisciplineNames.Add("Базовопрограмиране", "Базово програмиране");
            DisciplineNames.Add("Електротехника", "Електротехника");
            DisciplineNames.Add("Системнопрограмиране", "Системно програмиране");
            DisciplineNames.Add("Математиказакомпютърнинауки", "Математика за компютърни науки");
            DisciplineNames.Add("Базоваматематика", "Базова математика");
            DisciplineNames.Add("Синтезианализнаалгоритми", "Синтез и анализ на алгоритми");
            DisciplineNames.Add("Анализисинтезналогическисхеми", "Анализ и синтез на логически схеми");
            DisciplineNames.Add("Компютърнаелектроника", "Компютърна електроника");
            DisciplineNames.Add("Учебнапрактика-1част","Учебна практика - 1част");
            DisciplineNames.Add("Дискретниструктури", "Дискретни структури");
            DisciplineNames.Add("Измерваниявелектрониката", "Измервания в електрониката");
            DisciplineNames.Add("Обектно-ориентиранопрограмиране", "Обектно-ориентирано програмиране");
            DisciplineNames.Add("WEBдизайн", "WEB дизайн");
            DisciplineNames.Add("Организациянакомпютъра", "Организация на компютъра");
            DisciplineNames.Add("Учебнапрактика-2част", "Учебна практика - 2част");
            DisciplineNames.Add("Системенанализ", "Системен анализ");
            DisciplineNames.Add("Микропроцесорнатехника", "Микропроцесорна техника");
            DisciplineNames.Add("Програмнисистеми", "Програмни системи");
            DisciplineNames.Add("Цифровисистеми", "Цифрови системи");
            DisciplineNames.Add("Компютърнаграфикаивизуализация", "Компютърна графика и визуализация");
            DisciplineNames.Add("Базиотданни", "Бази от данни");
            DisciplineNames.Add("Компютърниархитектури", "Компютърни архитектури");
            DisciplineNames.Add("Технологиянасофтуернотопроизводство", "Технология на софтуерното производство");
            DisciplineNames.Add("Webпрограмниприложения", "Web програмни приложения");
            DisciplineNames.Add("Основинакомпютърнитекомуникации", "Основи на компютърните комуникации");
            DisciplineNames.Add("Изкуственинтелект", "Изкуствен интелект");
            DisciplineNames.Add("Микропроцесорнисистеми", "Микропроцесорни системи");
            DisciplineNames.Add("Компютърнимрежи", "Компютърни мрежи");
            DisciplineNames.Add("Компютърнапериферия", "Компютърна периферия");
            DisciplineNames.Add("Операционнисистеми", "Операционни системи");
            DisciplineNames.Add("Компилаторииинтерпретатори", "Компилатори и интерпретатори");
            DisciplineNames.Add("Многопотребителскиоперационнисистеми", "Многопотребителски операционни системи");
            DisciplineNames.Add("АдминистрираненалокалнииИнтернетмрежи", "Администриране на локални и Интернет мрежи");
            DisciplineNames.Add("Специализираникомпютърнисистеми", "Специализирани компютърни системи");
            DisciplineNames.Add("Webпрограмиране", "Web програмиране");
            DisciplineNames.Add("Взаимодействиечовек-компютър", "Взаимодействие човек-компютър");
            DisciplineNames.Add("Разпределенопрограмиране", "Разпределено програмиране");
            DisciplineNames.Add("Обектно-ориентираниприложения", "Обектно-ориентирани приложения");
            DisciplineNames.Add("Електроннатърговия", "Електронна търговия");
            DisciplineNames.Add("Едночиповимикроконтролери", "Едночипови микроконтролери");
            DisciplineNames.Add("Информационенмениджмънт","Информационен мениджмънт");                    
        }
    }
}
